onlineStore/app/controllers/application_controller.rb

    def authorize
        unless User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]