onlineStore/app/controllers/lineitems_controller.rb

  def index
    @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

  def create
    # @lineitem = Lineitem.new(lineitem_params)

    product = Product.find(params[:product_id])
    # @lineitem = @cart.lineitems.build(product_id: product.id)
    @lineitem = @cart.add_this_item(product.id)
    #@line_item = LineItem.new(line_item_params)
    respond_to do |format|
      if @lineitem.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-11-19 19:44:14.805865"], ["updated_at", "2022-11-19 19:44:14.805865"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 4], ["cart_id", 14], ["created_at", "2022-12-03 21:25:22.086846"], ["updated_at", "2022-12-03 21:25:22.086846"]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2022-12-03 21:25:28.206948"], ["quantity", 2], ["id", 12]]

    def set_lineitem
      @lineitem = Lineitem.find(params[:id])
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]