onlineStore/app/controllers/orders_controller.rb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 6]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 6], ["LIMIT", 1]]
---
  def new
    if @cart.lineitems.empty?

INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "llls"], ["address", "ss"], ["email", "ss"], ["paytype", "Check"], ["created_at", "2022-12-03 21:53:26.823250"], ["updated_at", "2022-12-03 21:53:26.823250"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 15]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
---
  def destroy
    @order.delete