onlineStore/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Apple"], ["description", "Good Apple"], ["image", "Apple.jpeg"], ["price", 5.5], ["created_at", "2022-12-06 07:13:54.100108"], ["updated_at", "2022-12-06 07:13:54.100108"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "image" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "iPhone"], ["description", "a new iPhone"], ["image", "iPhone.jpeg"], ["price", 999.0], ["updated_at", "2022-11-17 19:22:31.530985"], ["id", 5]]