onlineStore/app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
      <% if session[:user_id] %>
        Hello, <%= User.find_by(id: session[:user_id]).name%>