onlineStore/app/models/cart.rb

    def add_this_item(product_id)
        current_item = self.lineitems.find_by(product_id: product_id)
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ? AND "lineitems"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 4], ["LIMIT", 1]]