onlineStore/app/models/product.rb

SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."product_id" = ? LIMIT ?  [["product_id", 2], ["LIMIT", 1]]
---
    def make_sure_this_product_is_not_lineitems
        if self.lineitems.empty?