onlineStore/app/views/search/index.html.erb

  <%end%>
  <% @searchProducts = Product.where('name like ? and description like ? and price like ?', "%"+params[:name]+"%", "%"+params[:description]+"%", "%"+params[:price]+"%").all.order(:name) %>
---
SELECT "products".* FROM "products" WHERE (name like '%%' and description like '%%' and price like '%%') ORDER BY "products"."name" ASC